# Bases de datos en Python

## Índice
1. [Acceso a bases de datos relacionales](#sql)
2. [Crear bases de datos relacionales](#crear)
3. [Bases de datos NoSQL](#nosql)

<a id="sql"></a>
## Acceso a bases de datos relacionales

Podemos acceder a bases de datos SQL con la librería `pymysql`. Para instalarla escribimos en Anaconda Prompt:  
`conda install -c anaconda pymysql`

In [1]:
import pymysql

#### Ejemplo 1
Vamos a conectarnos a la base de datos NBA, con los siguientes parámetros:  
* servidor: relational.fit.cvut.cz
* usuario: guest
* contraseña: relational  
* base de datos: NBA

<img src="https://relational.fit.cvut.cz/assets/img/datasets-generated/NBA.svg" width="400">  

Vamos a crear una conexión con la base de datos

In [2]:
database_host = 'relational.fit.cvut.cz'
username = 'guest'
password = 'relational'
database_name = 'NBA'

# Abrir conexión con la base de datos
db = pymysql.connect(host=database_host, user=username, password=password, database=database_name)
cursor = db.cursor()

La función `connect()` crea una conexión a la base de datos. Un *cursor* nos permite realizar operaciones con los datos almacenados en la base de datos. Al ejecutar `cursor()` es como si estuviésemos utilizando `open()` cuando trabajábamos con archivos.  

<img src='https://i.ibb.co/L8HH0G5/cursor.png'>  

Una vez creado el cursor, podemos empezar a ejecutar comandos sobre el contenido de la base de datos utilizando el métido `execute()`,

Al ejecutar queries, utilizamos los métodos `fetchone()` (primera fila) o `fectchall()` (todas las filas) para visizar los resultados de las consultas. Para cerrar la conexión, utilizamso el método `close()`

In [3]:
cursor.execute("SELECT * FROM Player")
cursor.fetchall()

((1, 'Nicolas Batum'),
 (2, 'LaMarcus Aldridge'),
 (3, 'Robin Lopez'),
 (4, 'Wesley Matthews'),
 (5, 'Damian Lillard'),
 (6, 'Thomas Robinson'),
 (7, 'Maurice Williams'),
 (8, 'Will Barton'),
 (9, 'Dorell Wright'),
 (10, 'Earl Watson'),
 (11, 'CJ McCollum'),
 (12, 'Meyers Leonard'),
 (13, 'Victor Claver'),
 (14, 'Kent Bazemore'),
 (15, 'Pau Gasol'),
 (16, 'Chris Kaman'),
 (17, 'Jodie Meeks'),
 (18, 'Kendall Marshall'),
 (19, 'Steve Nash'),
 (20, 'Xavier Henry'),
 (21, 'Robert Sacre'),
 (22, 'Ryan Kelly'),
 (23, 'Nick Young'),
 (24, 'Marshon Brooks'),
 (25, 'Jordan Hill'),
 (26, 'Wesley Johnson'),
 (27, 'Andre Iguodala'),
 (28, 'Draymond Green'),
 (29, "Jermaine O'Neal"),
 (30, 'Klay Thompson'),
 (31, 'Stephen Curry'),
 (32, 'Marreese Speights'),
 (33, 'Harrison Barnes'),
 (34, 'Steve Blake'),
 (35, 'Jordan Crawford'),
 (36, 'Hilton Armstrong'),
 (37, 'Andrew Bogut'),
 (38, 'David Lee'),
 (39, 'Shawn Marion'),
 (40, 'Dirk Nowitzki'),
 (41, 'Samuel Dalembert'),
 (42, 'Monta Ellis'),
 (43, 'Jose Calderon'),
 (44, 'Vince Carter'),
 (45, 'Brandan Wright'),
 (46, 'Devin Harris'),
 (47, 'Jae Crowder'),
 (48, 'DeJuan Blair'),
 (49, 'Wayne Ellington'),
 (50, 'Bernard James'),
 (51, 'Shane Larkin'),
 (52, 'Chandler Parsons'),
 (53, 'Donatas Motiejunas'),
 (54, 'Omer Asik'),
 (55, 'James Harden'),
 (56, 'Jeremy Lin'),
 (57, 'Omri Casspi'),
 (58, 'Francisco Garcia'),
 (59, 'Isaiah Canaan'),
 (60, 'Jordan Hamilton'),
 (61, 'Patrick Beverley'),
 (62, 'Dwight Howard'),
 (63, 'Terrence Jones'),
 (64, 'Greg Smith'),
 (65, 'Joe Johnson'),
 (66, 'Paul Pierce'),
 (67, 'Mason Plumlee'),
 (68, 'Shaun Livingston'),
 (69, 'Deron Williams'),
 (70, 'Alan Anderson'),
 (71, 'Andray Blatche'),
 (72, 'Mizra Teletovic'),
 (73, 'Jorge Gutierrez'),
 (74, 'Marquis Teague'),
 (75, 'Jason Collins'),
 (76, 'Andrei Kirilenko'),
 (77, 'Marcus Thornton'),
 (78, 'JR Smith'),
 (79, 'Carmelo Anthony'),
 (80, 'Tyson Chandler'),
 (81, 'Iman Shumpert'),
 (82, 'Raymond Felton'),
 (83, 'Timothy Hardaway Jr.'),
 (84, 'Pablo Prigioni'),
 (85, 'Cole Aldrich'),
 (86, 'Jeremy Tyler'),
 (87, 'Shannon Brown'),
 (88, 'Toure Murry'),
 (89, "Amar'e Stoudemire"),
 (90, 'Richard Jefferson'),
 (91, 'Marvin Williams'),
 (92, 'Derrick Favors'),
 (93, 'Gordon Hayward'),
 (94, 'Trey Burke'),
 (95, 'Enes Kanter'),
 (96, 'Alec Burks'),
 (97, 'Diante Garrett'),
 (98, 'Ian Clark'),
 (99, 'Rudy Gobert'),
 (100, 'Jeremy Evans'),
 (101, 'John Lucas III'),
 (102, 'Brandon Rush'),
 (103, 'Tayshaun Prince'),
 (104, 'Zach Randolph'),
 (105, 'Marc Gasol'),
 (106, 'Courtney Lee'),
 (107, 'Mike Conley'),
 (108, 'Nick Calathes'),
 (109, 'Ed Davis'),
 (110, 'Mike Miller'),
 (111, 'Kosta Koufos'),
 (112, 'Tony Allen'),
 (113, 'James Johnson'),
 (114, 'Jon Leuer'),
 (115, 'Beno Udrih'),
 (116, 'Quincy Miller'),
 (117, 'Kenneth Faried'),
 (118, 'Timofey Mozgov'),
 (119, 'Randy Foye'),
 (120, 'Ty Lawson'),
 (121, 'Darrell Arthur'),
 (122, 'Evan Fournier'),
 (123, 'Aaron Brooks'),
 (124, 'Jan Vesely'),
 (125, 'Wilson Chandler'),
 (126, 'JJ Hickson'),
 (127, 'Anthony Randolph'),
 (128, 'Nate Robinson'),
 (129, 'Rudy Gay'),
 (130, 'Reggie Evans'),
 (131, 'DeMarcus Cousins'),
 (132, 'Ben McLemore'),
 (133, 'Ray McCallum'),
 (134, 'Travis Outlaw'),
 (135, 'Derrick Williams'),
 (136, 'Jared Cunningham'),
 (137, 'Jason Thompson'),
 (138, 'Quincy Acy'),
 (139, 'Aaron Gray'),
 (140, 'Isaiah Thomas'),
 (141, 'Al-Farouq Aminu'),
 (142, 'Anthony Davis'),
 (143, 'Greg Stiemsma'),
 (144, 'Tyreke Evans'),
 (145, 'Brian Roberts'),
 (146, 'Darius Miller'),
 (147, 'Alexis Ajinca'),
 (148, 'Austin Rivers'),
 (149, 'Anthony Morrow'),
 (150, 'Jeff Withey'),
 (151, 'Luke Babbitt'),
 (152, 'Eric Gordon'),
 (153, 'Jason Smith'),
 (154, 'Matt Barnes'),
 (155, 'Jared Dudley'),
 (156, 'DeAndre Jordan'),
 (157, 'Darren Collison'),
 (158, 'Chris Paul'),
 (159, 'Hidayet Turkoglu'),
 (160, 'Willie Green'),
 (161, 'Reggie Bullock'),
 (162, 'Ryan Hollins'),
 (163, 'Glen Davis'),
 (164, 'Jamal Crawford'),
 (165, 'Danny Granger'),
 (166, 'Blake Griffin'),
 (167, 'Corey Brewer'),
 (168, 'Kevin Love'),
 (169, 'Hidayet Turkoglu'),
 (170, 'Kevin Martin'),
 (171, 'Ricky Rubio'),
 (172, 'Gorgui Dieng'),
 (173, 'Jose Barea'),
 (174, 'Dante Cunningham'),
 (175, 'Chase Budinger'),
 (176, 'Robbie Hummel'),
 (177, 'Shabazz Muhammad'),
 (178, 'Luc Mbah a Moute'),
 (179, 'Alexey Shved'),
 (180, 'Jeff Green'),
 (181, 'Brandon Bass'),
 (182, 'Kris Humphries'),
 (183, 'Avery Bradley'),
 (184, 'Jerryd Bayless'),
 (185, 'Jared Sullinger'),
 (186, 'Christapher Johnson'),
 (187, 'Phil Pressey'),
 (188, 'Kelly Olynyk'),
 (189, 'Chris Babb'),
 (190, 'Joel Anthony'),
 (191, 'Rajon Rondo'),
 (192, 'Mike Dunleavy'),
 (193, 'Carlos Boozer'),
 (194, 'Joakim Noah'),
 (195, 'Jimmy Butler'),
 (196, 'Kirk Hinrich'),
 (197, 'DJ Augustin'),
 (198, 'Taj Gibson'),
 (199, 'Nazr Mohammed'),
 (200, 'Tony Snell'),
 (201, 'Jimmer Fredette'),
 (202, 'Erik Murphy'),
 (203, 'Tornike Shengelia'),
 (204, 'Terrence Ross'),
 (205, 'Amir Johnson'),
 (206, 'Jonas Valanciunas'),
 (207, 'Demar DeRozan'),
 (208, 'Kyle Lowry'),
 (209, 'Patrick Patterson'),
 (210, 'Steve Novak'),
 (211, 'John Salmons'),
 (212, 'Greivis Vasquez'),
 (213, 'Chuck Hayes'),
 (214, 'Nando De Colo'),
 (215, 'Landry Fields'),
 (216, 'Tyler Hansbrough'),
 (217, 'Lebron James'),
 (218, 'Udonis Haslem'),
 (219, 'Chris Bosh'),
 (220, 'Toney Douglas'),
 (221, 'Mario Chalmers'),
 (222, 'Rashad Lewis'),
 (223, 'Norris Cole'),
 (224, 'James Jones'),
 (225, 'Chris Andersen'),
 (226, 'Shane Battier'),
 (227, 'Michael Beasley'),
 (228, 'Justin Hamilton'),
 (229, 'Dwayne Wade'),
 (230, 'Khris Middleton'),
 (231, 'Jeff Adrien'),
 (232, 'Zaza Pachulia'),
 (233, 'Ramon Sessions'),
 (234, 'Brandon Knight'),
 (235, 'Giannis Antetokounmpo'),
 (236, 'John Henson'),
 (237, 'Ekpe Udoh'),
 (238, 'Ersan Ilyasova'),
 (239, 'OJ Mayo'),
 (240, 'Miroslav Raduljica'),
 (241, 'DJ Stephens'),
 (242, 'Nate Wolters'),
 (243, 'Josh Smith'),
 (244, 'Greg Monroe'),
 (245, 'Andre Drummond'),
 (246, 'Kyle Singler'),
 (247, 'Brandon Jennings'),
 (248, 'Rodney Stuckey'),
 (249, 'Jonas Jerebko'),
 (250, 'Kentavious Caldwell-Pope'),
 (251, 'Will Bynum'),
 (252, 'Charlie Villanueva'),
 (253, 'Luigi Datome'),
 (254, 'Tony Mitchell'),
 (255, 'Peyton Siva'),
 (256, 'Hollis Thompson'),
 (257, 'Thaddeus Young'),
 (258, 'Henry Sims'),
 (259, 'James Anderson'),
 (260, 'Michael Carter-Williams'),
 (261, 'Tony Wroten'),
 (262, 'Jarvis Varnado'),
 (263, 'Elliot Williams'),
 (264, 'Casper Ware'),
 (265, 'Brandon Davies'),
 (266, 'Arnett Moultrie'),
 (267, 'James Nunnally'),
 (268, 'DeMarre Carroll'),
 (269, 'Paul Millsap'),
 (270, 'Pero Antic'),
 (271, 'Kyle Korver'),
 (272, 'Jeff Teague'),
 (273, 'Louis Williams'),
 (274, 'Elton Brand'),
 (275, 'Mike Scott'),
 (276, 'Dennis Schroder'),
 (277, 'Mike Muscala'),
 (278, 'Shelvin Mack'),
 (279, 'Cartier Martin'),
 (280, 'Trevor Ariza'),
 (281, 'Trevor Booker'),
 (282, 'Marcin Gortat'),
 (283, 'Bradley Beal'),
 (284, 'John Wall'),
 (285, 'Drew Gooden'),
 (286, 'Martell Webster'),
 (287, 'Al Harrington'),
 (288, 'Andre Miller'),
 (289, 'Kevin Seraphin'),
 (290, 'Otto Porter'),
 (291, 'Chris Singleton'),
 (292, 'Garrett Temple'),
 (293, 'Michael Kidd-Gilchrist'),
 (294, 'Josh McRoberts'),
 (295, 'Al Jefferson'),
 (296, 'Gerald Henderson'),
 (297, 'Kemba Walker'),
 (298, 'Cody Zeller'),
 (299, 'Bismack Biyombo'),
 (300, 'Gary Neal'),
 (301, 'Luke Ridnour'),
 (302, 'Chris Douglas-Roberts'),
 (303, 'Jannero Pargo'),
 (304, 'Anthony Tolliver'),
 (305, 'DJ White'),
 (306, 'Paul George'),
 (307, 'David West'),
 (308, 'Roy Hibbert'),
 (309, 'Lance Stephenson'),
 (310, 'George Hill'),
 (311, 'Luis Scola'),
 (312, 'Evan Turner'),
 (313, 'Ian Mahinmi'),
 (314, 'Rasual Butler'),
 (315, 'Donald Sloan'),
 (316, 'Lavoy Allen'),
 (317, 'Chris Copeland'),
 (318, 'Solomon Hill'),
 (319, 'Luol Deng'),
 (320, 'Tristan Thompson'),
 (321, 'Spencer Hawes'),
 (322, 'Dion Waiters'),
 (323, 'Kyrie Irving'),
 (324, 'Jarrett Jack'),
 (325, 'Matthew Dellavedova'),
 (326, 'Tyler Zeller'),
 (327, 'Alonzo Gee'),
 (328, 'Sergey Karasev'),
 (329, 'Scotty Hopson'),
 (330, 'Anderson Varejao'),
 (331, 'Maurice Harkless'),
 (332, "Kyle O'Quinn"),
 (333, 'Nikola Vucevic'),
 (334, 'Arron Afflalo'),
 (335, 'Jameer Nelson'),
 (336, 'Andrew Nicholson'),
 (337, 'Victor Oladipo'),
 (338, 'Etwaun Moore'),
 (339, 'Tobias Harris'),
 (340, 'Doron Lamb'),
 (341, 'Dewayne Dedmon'),
 (342, 'Jason Maxiell'),
 (343, 'Ronnie Price'),
 (344, 'Julyan Stone'),
 (345, 'Ray Allen'),
 (346, 'Ronny Turiaf'),
 (347, 'Kawhi Leonard'),
 (348, 'Tim Duncan'),
 (349, 'Boris Diaw'),
 (350, 'Daniel Green'),
 (351, 'Tony Parker'),
 (352, 'Emanuel Ginobli'),
 (353, 'Tiago Splitter'),
 (354, 'Patrick Mills'),
 (355, 'Marco Belinelli'),
 (356, 'Jeff Ayres'),
 (357, 'Cory Joseph'),
 (358, 'Aron Baynes'),
 (359, 'Austin Daye'),
 (360, 'PJ Tucker'),
 (361, 'Channing Frye'),
 (362, 'Miles Plumlee'),
 (363, 'Goran Dragic'),
 (364, 'Eric Bledsoe'),
 (365, 'Gerald Green'),
 (366, 'Markieff Morris'),
 (367, 'Marcus Morris'),
 (368, 'Ish Smith'),
 (369, 'Dionte Christmas'),
 (370, 'Archie Goodwin'),
 (371, 'Alex Len'),
 (372, 'Shavlik Randolph'),
 (373, 'Orlando Johnson'),
 (374, 'Royce White'),
 (375, 'Damion James'),
 (376, 'Kevin Durant'),
 (377, 'Serge Ibaka'),
 (378, 'Kendrick Perkins'),
 (379, 'Andre Roberson'),
 (380, 'Russell Westbrook'),
 (381, 'Caron Butler'),
 (382, 'Steven Adams'),
 (383, 'Nick Collison'),
 (384, 'Reggie Jackson'),
 (385, 'Derek Fisher'),
 (386, 'Jeremy Lamb'),
 (387, 'Perry Jones'),
 (388, 'Hasheem Thabeet'),
 (389, 'JJ Redick'),
 (390, 'Dwight Buycks'),
 (391, 'David Lee'),
 (392, 'Nikola Pekovic'))

Podemos ver las tablas de la base de datos con la query `SHOW TABLES`

In [4]:
cursor.execute("SHOW TABLES")
cursor.fetchall()

(('Actions',),
 ('Game',),
 ('Player',),
 ('Team',),
 ('joined_drafted_all_players_original',))

El método `read_sql()` de pandas nos permite crear dataframes a partir de queries. Con este método no es necesario crear un cursor

In [5]:
import pandas as pd
query='SHOW TABLES'
df = pd.read_sql(query, db)
df.head()

                         Tables_in_NBA
0                              Actions
1                                 Game
2                               Player
3                                 Team
4  joined_drafted_all_players_original

Obtenemos los jugadores con más de 5 asistencias en algún partido

In [6]:
query = '''
SELECT
      PlayerName, Assists     
FROM Actions Act
JOIN Player Pla
ON Act.PlayerId = Pla.PlayerId
WHERE Assists > 5'''

Asistencias5 = pd.read_sql(query, db)
Asistencias5.head()

          PlayerName  Assists
0      Nicolas Batum        7
1  LaMarcus Aldridge        6
2    Wesley Matthews        6
3     Damian Lillard        8
4      Kent Bazemore        6

Obtenemos el TOP 10 jugadores con más asistencias en la temporada

In [7]:
query = '''
SELECT
      PlayerName, sum(Assists) as asistencias     
FROM Actions Act
JOIN Player Pla
ON Act.PlayerId = Pla.PlayerId
GROUP BY Pla.PlayerName
ORDER BY asistencias desc'''

Asistencias_top_10 = pd.read_sql(query, db)
Asistencias_top_10.head(10)

         PlayerName  asistencias
0        Chris Paul         27.0
1      Kemba Walker         25.0
2  Brandon Jennings         22.0
3         Ty Lawson         21.0
4     Demar DeRozan         20.0
5    Ramon Sessions         17.0
6      Andre Miller         17.0
7      Lebron James         16.0
8       DJ Augustin         16.0
9         John Wall         16.0

Obtenemos el TOP 10 Equipos con más puntuación media por partido

In [8]:
query = '''
SELECT
    t.TeamName,
    a.total_Points/a.games as avg_points_game
FROM (SELECT
          TeamId,
          count(DISTINCT(GameId)) as games,
          sum(Points) as total_Points
      FROM Actions
      GROUP BY TeamId) a
JOIN Team t
ON a.TeamId = t.TeamId
ORDER BY avg_points_game desc
'''

puntuacion_avg = pd.read_sql(query, db)
puntuacion_avg.head(10)

                 TeamName  avg_points_game
0  Portland Trail Blazers         124.0000
1     Cleveland Cavaliers         119.0000
2        Dallas Mavericks         116.5000
3   Golden State Warriors         112.5000
4    Los Angeles Clippers         111.0000
5       Charlotte Bobcats         108.3333
6            Phoenix Suns         108.0000
7      Los Angeles Lakers         107.0000
8          Denver Nuggets         107.0000
9   Oklahoma City Thunder         106.0000

#### Ejemplo 2
Vamos a conectarnos a la base de datos de los empleados de una empresa  
* servidor: relational.fit.cvut.cz
* usuario: guest
* contraseña: relational  
* base de datos: employees
<img src = 'https://relational.fit.cvut.cz/assets/img/datasets-generated/employee.svg'>

In [9]:
database_host = 'relational.fit.cvut.cz'
username = 'guest'
password = 'relational'
database_name = 'employee'

# Abrir conexión con la base de datos
db = pymysql.connect(host=database_host, user=username, password=password, database=database_name)
cursor = db.cursor()

In [10]:
query = '''SHOW TABLES'''
pd.read_sql(query,db)

  Tables_in_employee
0        departments
1           dept_emp
2       dept_manager
3          employees
4           salaries
5             titles

Obtener el salario máximo, mínimo y medio por género y cargo

In [11]:
query = '''
SELECT 
    e.gender,
    t.title,
    max(s.salary) as max_salary,
    min(s.salary) as min_salary,
    avg(s.salary) as avg_salary
FROM salaries s
JOIN employees e
ON s.emp_no=e.emp_no
JOIN titles t
ON s.emp_no=t.emp_no
WHERE s.to_date = '9999-01-01'
GROUP BY e.gender, t.title
ORDER BY t.title, e.gender'''

Salarios = pd.read_sql(query, db)
Salarios

   gender               title  max_salary  min_salary  avg_salary
0       M  Assistant Engineer      133712       39827  67611.2685
1       F  Assistant Engineer      117968       39469  67159.3064
2       M            Engineer      140784       38942  67974.4227
3       F            Engineer      138273       39519  67891.0149
4       M             Manager      108407       56654  84783.4545
5       F             Manager       93193       58189  75114.7692
6       M     Senior Engineer      140784       39285  70869.6326
7       F     Senior Engineer      138273       39476  70754.1607
8       M        Senior Staff      158220       39012  80735.5559
9       F        Senior Staff      152710       39227  80661.5952
10      M               Staff      158220       39186  77520.7045
11      F               Staff      152687       38936  77503.1917
12      M    Technique Leader      132233       38623  67600.3207
13      F    Technique Leader      144434       39812  67371.5803

## <span style="color:red">Do it yourself</span>

Vamos a conectarnos a la base con datos históricos de baloncesto, con los siguientes parámetros:  
* servidor: relational.fit.cvut.cz
* usuario: guest
* contraseña: relational  
* base de datos: Basketball_men  

[Enlace al diagrama del modelo relacional](https://relational.fit.cvut.cz/assets/img/datasets-generated/Basketball_men.svg)

In [12]:
database_host = 'relational.fit.cvut.cz'
username = 'guest'
password = 'relational'
database_name = 'Basketball_men'

# Abrir conexión con la base de datos
db = pymysql.connect(host=database_host, user=username, password=password, database=database_name)

query = '''SHOW TABLES'''
pd.read_sql(query, db)

  Tables_in_Basketball_men
0           awards_coaches
1           awards_players
2                  coaches
3                    draft
4           player_allstar
5                  players
6            players_teams
7              series_post
8                    teams

Obtenemos los jugadores con al menos 30.000 puntos en su carrera, que hayan obtenido algún premio y continúen vivos. Obtener su altura en metros (en la base de datos está en pulgadas)

In [13]:
query =  '''
SELECT
    firstName,
    middleName,
    lastName,
    deathDate,
    height/39.37 as altura,
    total_points
FROM players p
JOIN (SELECT
          playerID, sum(points) as total_points
      FROM players_teams
      GROUP BY playerID
     ) pt
ON p.playerID = pt.playerID
JOIN (SELECT DISTINCT
          playerID
      FROM awards_players) a
ON p.playerID = a.playerID
WHERE total_points >= 30000 AND deathDate = '0000-00-00' '''

pd.read_sql(query, db).head()

  firstName middleName      lastName   deathDate    altura  total_points
0    Kareem       None  Abdul-Jabbar  0000-00-00  2.159004       38387.0
1    Julius   Winfield        Erving  0000-00-00  1.981204       30026.0
2   Michael    Jeffrey        Jordan  0000-00-00  1.981204       32292.0
3      Karl    Anthony        Malone  0000-00-00  2.057404       36928.0

<a id="crear"></a>
## Crear bases de datos relacionales

SQLite es un sistema de gestión de bases de datos basado en SQL optimizado para entornos pequeños como aplicaciones móviles. Puede integrarse con Python gracias a la librería `sqlite3`, incluida por defecto en las versiones más recientes de Python.

In [14]:
import sqlite3

In [15]:
# Conexión a una base de datos
conn = sqlite3.connect('my_database.sqlite')
cursor = conn.cursor()

In [16]:
# Crear tablas
cursor.execute('''CREATE TABLE SCHOOL
(ID INT PRIMARY KEY NOT NULL,
NAME TEXT NOT NULL,
AGE INT NOT NULL,
CITY CHAR(50),
MARKS INT);''')

In [17]:
# Insertar valores
cursor.execute("INSERT INTO SCHOOL (ID,NAME,AGE,CITY,MARKS) VALUES (1, 'Luis', '24', 'Madrid', 8)")
cursor.execute("INSERT INTO SCHOOL (ID,NAME,AGE,CITY,MARKS) VALUES (2, 'Ana', '34', 'Bilbao', 9)")
cursor.execute("INSERT INTO SCHOOL (ID,NAME,AGE,CITY,MARKS) VALUES (3, 'Pedro', '19', 'Santander', 10)")
cursor.execute("INSERT INTO SCHOOL (ID,NAME,AGE,CITY,MARKS) VALUES (4, 'Marta', '21', 'Madrid', 6)")
conn.commit()

In [18]:
# Ejecutar queries
pd.read_sql('SELECT * FROM SCHOOL', conn)

   ID   NAME  AGE       CITY  MARKS
0   1   Luis   24     Madrid      8
1   2    Ana   34     Bilbao      9
2   3  Pedro   19  Santander     10
3   4  Marta   21     Madrid      8

In [19]:
# Crear tablas a partir de dataframes
Salarios.to_sql('Salaries', conn, index='False')

In [20]:
# Listar tablas
pd.read_sql('SELECT name FROM sqlite_master WHERE type="table"', conn)

       name
0    SCHOOL
1  Salaries

In [22]:
# Borrar tablas
cursor.execute('DROP TABLE IF EXISTS Salaries')

In [25]:
pd.read_sql('SELECT name FROM sqlite_master WHERE type="table"', conn)

     name
0  SCHOOL

In [27]:
# Actualizar registros
conn.execute('UPDATE SCHOOL set MARKS=7 WHERE ID=3')
conn.commit()

In [28]:
pd.read_sql('SELECT * FROM SCHOOL', conn)

   ID   NAME  AGE       CITY  MARKS
0   1   Luis   24     Madrid      8
1   2    Ana   34     Bilbao      9
2   3  Pedro   19  Santander      7
3   4  Marta   21     Madrid      8

In [29]:
# Borrar registros
conn.execute('DELETE FROM SCHOOL WHERE ID=2')

In [30]:
pd.read_sql('SELECT * FROM SCHOOL', conn)

   ID   NAME  AGE       CITY  MARKS
0   1   Luis   24     Madrid      8
1   3  Pedro   19  Santander      7
2   4  Marta   21     Madrid      8

<a id="nosql"></a>
## Bases de datos NoSQL (MongoDB)

Las principales diferencias entre SQL y MongoDB son las siguientes: 
<img src='http://4.bp.blogspot.com/-edz2_QrFvCE/UnzBhKZE3FI/AAAAAAAAAEs/bTEsqnZFTXw/s1600/SQL-MongoDB+Correspondence.PNG'>

Vamos a conectarnos a una base de datos en MongoDB, para lo cual debemos instalar las siguientes librerías:  
`conda install -c anaconda pymongo`  
`conda install -c anaconda dnspython`

In [23]:
from pymongo import MongoClient
import dns

In [24]:
client = MongoClient("mongodb+srv://test:test@cluster0-czvtb.mongodb.net/admin?retryWrites=true&w=majority")

Nos conectamos a la base de datos [Sample Airbnb](https://docs.atlas.mongodb.com/sample-data/sample-airbnb/). Esta base de datos contiene una única colección llamada listingsAndReviews, que contiene documentos representando detalles de viviendas turísticas en airbnb.

In [31]:
db = client.get_database('sample_airbnb')

In [32]:
records = db.listingsAndReviews

In [34]:
# Contamos los documentos
records.count_documents({})

5555

Para hacer queries se utiliza el método `find()`

In [38]:
#list(records.find())[0]

Filtramos viviendas con 2 baños y 3 dormitorios, con alguna review

In [39]:
# list(records.find({'bathrooms':2,
#                   'bedrooms':3,
#                   'number_of_reviews': {'$ne':0}}).limit(5))

Puedes encontrar más documentación sobre la librería `pymongo` en https://api.mongodb.com/python/current/